import { supabaseUrl } from "../services/supabase";

const imageUrl = `${supabaseUrl}/storage/v1/object/public/cabin-images/`;

export const cabins = [
  {
    name: "001",
    maxCapacity: 2,
    regularPrice: 2500000,
    discount: 0,
    image: imageUrl + "cabin-001.jpg",
    description:
      "در کابین چوبی دنج 001، بهترین اقامتگاه لوکس را برای زوج‌ها کشف کنید. این کابین خیره‌کننده که در جنگلی زیبا واقع شده است، خلوتگاهی منزوی و صمیمی را ارائه می‌دهد. در داخل، از فضای داخلی چوبی مدرن با کیفیت بالا، یک قسمت نشیمن راحت، یک شومینه و یک آشپزخانه کاملاً مجهز لذت ببرید. تخت خواب شیک کینگ که با ملحفه های ظریف پوشیده شده است، خوابی آرام در شب را تضمین می کند. در دوش آبگرم استراحت کنید و در عرشه خصوصی با جکوزی استراحت کنید.",
  },
  {
    name: "002",
    maxCapacity: 2,
    regularPrice: 3500000,
    discount: 25,
    image: imageUrl + "cabin-002.jpg",
    description:
      "به آرامش طبیعت فرار کنید و در کابین دنج ما 002 غرق در تجمل شوید. این کابین برای زوج‌ها ایده‌آل است، این کابین خلوت و صمیمی در قلب جنگلی زیبا ارائه می‌دهد. در داخل، فضای داخلی گرم و جذابی خواهید دید که از چوب با کیفیت بالا ساخته شده است، یک منطقه نشیمن راحت، یک شومینه و یک آشپزخانه کاملاً مجهز. اتاق خواب مجلل دارای یک تخت کینگ شیک و دوش آبگرم است. در عرشه خصوصی با جکوزی استراحت کنید و از زیبایی های طبیعت لذت ببرید.",
  },
  {
    name: "003",
    maxCapacity: 4,
    regularPrice: 3000000,
    discount: 0,
    image: imageUrl + "cabin-003.jpg",
    description:
      "زندگی خانوادگی لوکس را در کابین چوبی متوسط ما 003 تجربه کنید. این کابین برای خانواده های حداکثر 4 نفره ایده آل است، این کابین فضایی راحت و دلپذیر با تمام امکانات مدرن ارائه می دهد. در داخل، فضای داخلی گرم و دلپذیری خواهید دید که از چوب با کیفیت بالا ساخته شده است، یک منطقه نشیمن راحت، یک شومینه، و یک آشپزخانه کاملا مجهز. اتاق خواب‌ها دارای تخت‌های مجلل و حمام‌هایی مانند اسپا هستند. کابین دارای یک عرشه خصوصی با جکوزی و محل نشیمن در فضای باز است که برای تماشای محیط طبیعی مناسب است.",
  },
  {
    name: "004",
    maxCapacity: 4,
    regularPrice: 5000000,
    discount: 50,
    image: imageUrl + "cabin-004.jpg",
    description:
      "در این کابین با اندازه متوسط 004، از تعطیلات خانوادگی لوکس نهایت لذت را ببرید. این کابین که برای خانواده های حداکثر 4 نفره طراحی شده است، اقامتگاه مجللی را برای مسافران فهیم فراهم می کند. در داخل کابین، فضای داخلی مجلل ساخته شده از مرغوب ترین چوب، فضای نشیمن راحت، شومینه، و آشپزخانه لذیذ کاملاً مجهز به خود می بالد. اتاق خواب ها با تخت های مجلل و حمام های اختصاصی الهام گرفته از اسپا تزئین شده اند. به عرشه خصوصی خود بروید و در حین استراحت در وان آب گرم خود در محیط طبیعی غوطه ور شوید.",
  },
  {
    name: "005",
    maxCapacity: 6,
    regularPrice: 3500000,
    discount: 0,
    image: imageUrl + "cabin-005.jpg",
    description:
      "از یک استراحت راحت و دنج با گروه یا خانواده خود در کابین بزرگ 005 ما لذت ببرید. این کابین که برای گنجایش حداکثر 6 نفر طراحی شده است، خلوتگاهی خلوت در قلب طبیعت ارائه می دهد. در داخل کابین، فضای داخلی گرم و دلپذیر ساخته شده از چوب مرغوب، فضای نشیمن با شومینه، و آشپزخانه ای کاملاً مجهز است. اتاق خواب ها راحت و مجهز به حمام اختصاصی هستند. به عرشه خصوصی خود بروید و در حالی که در جکوزی خود استراحت می کنید، به محیط طبیعی بروید.",
  },
  {
    name: "006",
    maxCapacity: 6,
    regularPrice: 8000000,
    discount: 0,
    image: imageUrl + "cabin-006.jpg",
    description:
      "مظهر لوکس بودن را با گروه یا خانواده خود در کابین چوبی جادار 006 ما تجربه کنید. این کابین که برای گنجایش راحت حداکثر 6 نفر طراحی شده است، خلوتگاهی مجلل در قلب طبیعت ارائه می دهد. در داخل کابین، فضای داخلی مجلل ساخته شده از چوب درجه یک، یک منطقه نشیمن بزرگ با شومینه، و یک آشپزخانه کاملا مجهز لذیذ است. اتاق خواب ها با تخت های مجلل و حمام های اختصاصی شبیه اسپا تزئین شده اند. به عرشه خصوصی خود بروید و در حین استراحت در وان آب گرم خود در محیط طبیعی غوطه ور شوید.",
  },
  {
    name: "007",
    maxCapacity: 8,
    regularPrice: 6000000,
    discount: 10,
    image: imageUrl + "cabin-007.jpg",
    description:
      "گروه بزرگ یا چندین خانواده خود را در کابین چوبی بزرگ و جادار 007 اسکان دهید. این کابین با طراحی راحت تا 8 نفر، خلوتگاهی منزوی در قلب جنگل ها و کوه های زیبا ارائه می دهد. در داخل کابین، فضای داخلی گرم و دلپذیر ساخته شده از چوب مرغوب، چندین قسمت نشیمن با شومینه، و آشپزخانه کاملاً مجهز است. اتاق خواب ها راحت و مجهز به حمام اختصاصی هستند. کابین دارای یک عرشه خصوصی با جکوزی و محل نشیمن در فضای باز است که برای تماشای محیط طبیعی مناسب است.",
  },
  {
    name: "008",
    maxCapacity: 10,
    regularPrice: 1400000,
    discount: 0,
    image: imageUrl + "cabin-008.jpg",
    description:
      "مظهر تجمل و عظمت را با گروه بزرگ خود یا خانواده های متعدد در کابین بزرگ ما 008 تجربه کنید. این کابین خلوتگاه مجللی را ارائه می دهد که تمام نیازها و خواسته های شما را برآورده می کند. کابین دارای طراحی مجلل است و از پرداخت های سطح بالا، جزئیات پیچیده و مرغوب ترین چوب در سراسر آن برخوردار است. در داخل کابین، چندین قسمت نشیمن باشکوه با شومینه، یک ناهار خوری رسمی، و یک آشپزخانه لذیذ که رویای یک سرآشپز است، وجود دارد. اتاق خواب ها برای نهایت راحتی و تجمل طراحی شده اند، با تخت های مجلل و حمام های اختصاصی الهام گرفته از اسپا. بیرون بروید و از عرشه خصوصی خود که دارای یک جکوزی مجلل و قسمت های نشیمن برای استراحت و لذت نهایی است، در زیبایی طبیعت غوطه ور شوید.",
  },
];
